Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.Site
The Site class represents the site filter expression.

Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.Site.#ctor
Initializes a new instance of the Site class.